; domain
(define (domain assignment_problem_2)
    (:requirements :strips :typing)

    (:types
        location ; defines a location
        work_station ; defines a work station
        box ; defines a box
        supply ; defines a general supply, will be extended
        robot ; defines a robot
        valve - supply
        bolt - supply
        tool - supply
        warehouse - location



        drone - robot ; defines a drone
        agv - robot  ; defines an agv
        number ; defines a number for counting 
        
        )
    (:constants
   
    )


    (:predicates
        
        (atwa ?x - warehouse ?l - location) ; Defines where the warehouse is
        (atws ?x - work_station ?l - location) ; Defines where the work station is
        (atbl ?x - box ?l - location) ; Defines where the box is
        (atbw ?x - box ?l - work_station) ; Defines where the box is
        (ats ?x - supply ?l - location) ; Defines where the supply is
        (atr ?x - robot ?l - location) ; Defines where the robot is
        (contains ?x - box ?y - supply) ; Defines what the box contains

        (has ?ws - work_station ?s - supply) ; Defines what the work station has
        (box_delivered ?b - box ?ws - work_station) ; Defines what boxes have been delivered to the work station


        (carries ?r - robot ?b - box) ; Defines what the robot carries

        (connected ?l1 - location ?l2 - location) ; Defines what locations are connected
        
        (free ?l - location)
        (loaded ?r - robot) ; defines if a robot is loaded
        (empty ?b - box) ; defines if a box is empty
        (has_bolt ?ws - work_station) ; defines if a work station has a bolt
        (has_tool ?ws - work_station) ; defines if a work station has a bolt
        (has_valve ?ws - work_station) ; defines if a work station has a bolt

        (is_bolt ?b - supply)
        (is_valve ?b - supply)
        (is_tool ?b - supply)


        (capacity ?r - robot ?n - number) ; defines the capacity of a robot
        (prec ?n1 - number ?n2 - number) ; defines the precedence of a number
        (succ ?n1 - number ?n2 - number) ; defines the successor of a number

        (max_capacity ?n - number ?r - robot) ; defines the maximum capacity of a robot
        (min_capacity ?n - number  ?r - robot) ; defines the minimum capacity of a robot
    
    )

    ; moves a robot from one location to another
    (:action move_robot
        :parameters (?r - robot ?l1 - location ?l2 - location ?c - number)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (capacity ?r ?c) (min_capacity ?c ?r))
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)))
    )

     (:action move_box_and_robot
        :parameters (?r - robot ?l1 - location ?l2 - location ?b - box ?c - number)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (carries ?r ?b) (capacity ?r ?c) (not (min_capacity ?c ?r)) )
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)) (atbl ?b ?l2) )
    )

    ; pick up a box
    (:action pick_box_from_location
        :parameters (?r - robot ?b - box ?l - location ?c0 - number ?c1 - number)
        :precondition (and (atr ?r ?l) (atbl ?b ?l) (capacity ?r ?c0) (not (max_capacity ?c0 ?r)) (succ ?c0 ?c1))
        :effect (and  (not (atbl ?b ?l)) (carries ?r ?b) (not (capacity ?r ?c0)) (capacity ?r ?c1) )
    )

    (:action deliver_box_to_ws
        :parameters (?r - robot ?b - box ?ws - work_station ?l - location ?s - supply ?c0 - number ?c1 - number)
        :precondition (and (atr ?r ?l) (atws ?ws ?l)  (carries ?r ?b) (contains ?b ?s) (capacity ?r ?c0) (prec ?c0 ?c1) (not (min_capacity ?c0 ?r)))
        :effect (and  (not(carries ?r ?b)) (atbw ?b ?ws) (not(atbl ?b ?l)) (box_delivered ?b ?ws) (ats ?s ?l) (not (capacity ?r ?c0)) (capacity ?r ?c1) )
    )
   
    (:action fill_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location) 
        :precondition (and (atbl ?b ?l) (atr ?r ?l) (empty ?b) (ats ?s ?l) )
        :effect (and (contains ?b ?s) (not (empty ?b)) (not (ats ?s ?l)))
    )


    (:action empty_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location ?ws - work_station)
        :precondition (and (atr ?r ?l) (atws ?ws ?l) (contains ?b ?s) (ats ?s ?l) (box_delivered ?b ?ws) (ats ?s ?l) (not (loaded ?r)) )
        :effect (and (not (contains ?b ?s)) (empty ?b) (has ?ws ?s) (not (ats ?s ?l)) )
    )

    (:action bolt_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_bolt ?s))
        :effect (and (has_bolt ?ws))
    )
    
    (:action tool_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_tool ?s))
        :effect (and (has_tool ?ws))
    )
    (:action valve_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_valve ?s))
        :effect (and (has_valve ?ws))
    )
    


    
    


)

; problem
(define (problem problem_2) (:domain assignment_problem_2)
(:objects 
    agv1 - agv
    drone1 - drone
    l1 l2 l3 l4 -location
    centralwarehouse - warehouse
    b1 b2 b3 b4 b5 b6 - box
    valve1 valve2 valve3 valve4 valve5 valve6 - valve
    bolt1 bolt2 bolt3 bolt4 bolt5 bolt6 - bolt
    tool1 tool2 tool3 tool4 tool5 tool6 - tool
    ws1 ws2 ws3 ws4 ws5  - work_station
    s0 s1 s2 s3 - num
    )

(:init
    ; define counting method
    (succ s0 s1)
    (succ s1 s2)
    (succ s2 s3)  
    (prec s1 s0)
    (prec s2 s1)
    (prec s3 s2)

    ; defines max and min capacity for the agv
    (max_capacity s3 agv1)
    (min_capacity s0 agv1)
     
    ; robot starts at central warehouse
    (atr agv1 centralwarehouse)
    
    ; initial capacity is zero
    (capacity agv1 s0 )

    ; all locations are initially free
    (free l1)
    (free l2)
    (free l3)
    (free l4)

    ; all supplies are at central warehouse
    (ats valve1 centralwarehouse)
    (ats valve2 centralwarehouse)
    (ats valve3 centralwarehouse)
    (ats valve4 centralwarehouse)
    (ats valve5 centralwarehouse)
    (ats valve6 centralwarehouse)
    (ats bolt1 centralwarehouse)
    (ats bolt2 centralwarehouse)
    (ats bolt3 centralwarehouse)
    (ats bolt4 centralwarehouse)
    (ats bolt5 centralwarehouse)
    (ats bolt6 centralwarehouse)
    (ats tool1 centralwarehouse)
    (ats tool2 centralwarehouse)
    (ats tool3 centralwarehouse)
    (ats tool4 centralwarehouse)
    (ats tool5 centralwarehouse)
    (ats tool6 centralwarehouse)

    ; definition of the sub-class for each sulpply
    (is_bolt bolt1)
    (is_bolt bolt2)
    (is_bolt bolt3)
    (is_bolt bolt4)
    (is_bolt bolt5)
    (is_bolt bolt6)
    (is_valve valve1)
    (is_valve valve2)
    (is_valve valve3)
    (is_valve valve4)
    (is_valve valve5)
    (is_valve valve6)
    (is_tool tool1)
    (is_tool tool2)
    (is_tool tool3)
    (is_tool tool4)
    (is_tool tool5)
    (is_tool tool6)

    ; all boxes are at central warehouse
    (atbl b1 centralwarehouse)
    (atbl b2 centralwarehouse)
    (atbl b3 centralwarehouse)
    (atbl b4 centralwarehouse)
    (atbl b5 centralwarehouse)
    (atbl b6 centralwarehouse)
   
    ; all boxes are empty
    (empty b1)
    (empty b2)
    (empty b3)
    (empty b4)
    (empty b5)
    (empty b6)

    ; create map
    (connected centralwarehouse l1)
    (connected centralwarehouse l2)
    (connected centralwarehouse l3)
    (connected l3 l4)
    (connected l4 l3)
    (connected l1 centralwarehouse)
    (connected l2 centralwarehouse)
    (connected l3 centralwarehouse)

    ; put workstation at location
    (atws ws1 l1)
    (atws ws2 l2)
    (atws ws3 l3)
    (atws ws4 l4)
    (atws ws5 l4)

)

(:goal (and
    (has_bolt ws3)
    (has_tool ws2)
    (has_bolt ws2)
    (has_valve ws1)
))


)

; plan
1. (fill_box agv1 b6 bolt1 centralwarehouse)
   deleted: (empty b6) (ats bolt1 centralwarehouse)
   added: (contains b6 bolt1)
   goals met: 0 of 4
2. (pick_box_from_location agv1 b6 centralwarehouse s0 s1)
   deleted: (atbl b6 centralwarehouse) (capacity agv1 s0)
   added: (carries agv1 b6) (capacity agv1 s1)
   goals met: 0 of 4
3. (fill_box agv1 b5 tool4 centralwarehouse)
   deleted: (empty b5) (ats tool4 centralwarehouse)
   added: (contains b5 tool4)
   goals met: 0 of 4
4. (pick_box_from_location agv1 b5 centralwarehouse s1 s2)
   deleted: (atbl b5 centralwarehouse) (capacity agv1 s1)
   added: (carries agv1 b5) (capacity agv1 s2)
   goals met: 0 of 4
5. (move_box_and_robot agv1 centralwarehouse l2 b5 s2)
   deleted: (free l2) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l2) (atbl b5 l2)
   goals met: 0 of 4
6. (move_box_and_robot agv1 l2 centralwarehouse b6 s2)
   deleted: (free centralwarehouse) (atr agv1 l2)
   added: (free l2) (atr agv1 centralwarehouse) (atbl b6 centralwarehouse)
   goals met: 0 of 4
7. (pick_box_from_location agv1 b3 centralwarehouse s2 s3)
   deleted: (atbl b3 centralwarehouse) (capacity agv1 s2)
   added: (carries agv1 b3) (capacity agv1 s3)
   goals met: 0 of 4
8. (move_box_and_robot agv1 centralwarehouse l2 b3 s3)
   deleted: (free l2) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l2) (atbl b3 l2)
   goals met: 0 of 4
9. (deliver_box_to_ws agv1 b6 ws2 l2 bolt1 s3 s2)
   deleted: (carries agv1 b6) (capacity agv1 s3)
   added: (atbw b6 ws2) (box_delivered b6 ws2) (ats bolt1 l2) (capacity agv1 s2)
   goals met: 0 of 4
10. (move_box_and_robot agv1 l2 centralwarehouse b5 s2)
   deleted: (free centralwarehouse) (atr agv1 l2)
   added: (free l2) (atr agv1 centralwarehouse) (atbl b5 centralwarehouse)
   goals met: 0 of 4
11. (pick_box_from_location agv1 b4 centralwarehouse s2 s3)
   deleted: (atbl b4 centralwarehouse) (capacity agv1 s2)
   added: (carries agv1 b4) (capacity agv1 s3)
   goals met: 0 of 4
12. (move_box_and_robot agv1 centralwarehouse l3 b5 s3)
   deleted: (free l3) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l3) (atbl b5 l3)
   goals met: 0 of 4
13. (move_box_and_robot agv1 l3 l4 b5 s3)
   deleted: (free l4) (atr agv1 l3)
   added: (free l3) (atr agv1 l4) (atbl b5 l4)
   goals met: 0 of 4
14. (move_box_and_robot agv1 l4 l3 b4 s3)
   deleted: (free l3) (atr agv1 l4)
   added: (free l4) (atr agv1 l3) (atbl b4 l3)
   goals met: 0 of 4
15. (deliver_box_to_ws agv1 b5 ws3 l3 tool4 s3 s2)
   deleted: (carries agv1 b5) (atbl b5 l3) (capacity agv1 s3)
   added: (atbw b5 ws3) (box_delivered b5 ws3) (ats tool4 l3) (capacity agv1 s2)
   goals met: 0 of 4
16. (move_box_and_robot agv1 l3 centralwarehouse b4 s2)
   deleted: (free centralwarehouse) (atr agv1 l3)
   added: (free l3) (atr agv1 centralwarehouse) (atbl b4 centralwarehouse)
   goals met: 0 of 4
17. (pick_box_from_location agv1 b6 centralwarehouse s2 s3)
   deleted: (atbl b6 centralwarehouse) (capacity agv1 s2)
   added: (carries agv1 b6) (capacity agv1 s3)
   goals met: 0 of 4
18. (fill_box agv1 b4 valve2 centralwarehouse)
   deleted: (empty b4) (ats valve2 centralwarehouse)
   added: (contains b4 valve2)
   goals met: 0 of 4
19. (move_box_and_robot agv1 centralwarehouse l1 b3 s3)
   deleted: (free l1) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l1) (atbl b3 l1)
   goals met: 0 of 4
20. (deliver_box_to_ws agv1 b4 ws1 l1 valve2 s3 s2)
   deleted: (carries agv1 b4) (capacity agv1 s3)
   added: (atbw b4 ws1) (box_delivered b4 ws1) (ats valve2 l1) (capacity agv1 s2)
   goals met: 0 of 4
21. (empty_box agv1 b4 valve2 l1 ws1)
   deleted: (contains b4 valve2) (ats valve2 l1)
   added: (empty b4) (has ws1 valve2)
   goals met: 0 of 4
22. (move_box_and_robot agv1 l1 centralwarehouse b3 s2)
   deleted: (free centralwarehouse) (atr agv1 l1)
   added: (free l1) (atr agv1 centralwarehouse) (atbl b3 centralwarehouse)
   goals met: 0 of 4
23. (move_box_and_robot agv1 centralwarehouse l2 b6 s2)
   deleted: (free l2) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l2) (atbl b6 l2)
   goals met: 0 of 4
24. (pick_box_from_location agv1 b5 l2 s2 s3)
   deleted: (atbl b5 l2) (capacity agv1 s2)
   added: (carries agv1 b5) (capacity agv1 s3)
   goals met: 0 of 4
25. (fill_box agv1 b3 bolt1 l2)
   deleted: (empty b3) (ats bolt1 l2)
   added: (contains b3 bolt1)
   goals met: 0 of 4
26. (deliver_box_to_ws agv1 b3 ws2 l2 bolt1 s3 s2)
   deleted: (carries agv1 b3) (atbl b3 l2) (capacity agv1 s3)
   added: (atbw b3 ws2) (box_delivered b3 ws2) (ats bolt1 l2) (capacity agv1 s2)
   goals met: 0 of 4
27. (deliver_box_to_ws agv1 b5 ws2 l2 tool4 s2 s1)
   deleted: (carries agv1 b5) (capacity agv1 s2)
   added: (atbw b5 ws2) (box_delivered b5 ws2) (ats tool4 l2) (capacity agv1 s1)
   goals met: 0 of 4
28. (empty_box agv1 b5 tool4 l2 ws2)
   deleted: (contains b5 tool4) (ats tool4 l2)
   added: (empty b5) (has ws2 tool4)
   goals met: 0 of 4
29. (tool_acquired ws2 tool4)
   added: (has_tool ws2)
   goals met: 1 of 4
30. (empty_box agv1 b3 bolt1 l2 ws2)
   deleted: (contains b3 bolt1) (ats bolt1 l2)
   added: (empty b3) (has ws2 bolt1)
   goals met: 1 of 4
31. (bolt_acquired ws2 bolt1)
   added: (has_bolt ws2)
   goals met: 2 of 4
32. (move_box_and_robot agv1 l2 centralwarehouse b6 s1)
   deleted: (free centralwarehouse) (atr agv1 l2)
   added: (free l2) (atr agv1 centralwarehouse) (atbl b6 centralwarehouse)
   goals met: 2 of 4
33. (valve_acquired ws1 valve2)
   added: (has_valve ws1)
   goals met: 3 of 4
34. (move_box_and_robot agv1 centralwarehouse l3 b6 s1)
   deleted: (free l3) (atr agv1 centralwarehouse)
   added: (free centralwarehouse) (atr agv1 l3) (atbl b6 l3)
   goals met: 3 of 4
35. (deliver_box_to_ws agv1 b6 ws3 l3 bolt1 s1 s0)
   deleted: (carries agv1 b6) (atbl b6 l3) (capacity agv1 s1)
   added: (atbw b6 ws3) (box_delivered b6 ws3) (ats bolt1 l3) (capacity agv1 s0)
   goals met: 3 of 4
36. (empty_box agv1 b6 bolt1 l3 ws3)
   deleted: (contains b6 bolt1) (ats bolt1 l3)
   added: (empty b6) (has ws3 bolt1)
   goals met: 3 of 4
37. (bolt_acquired ws3 bolt1)
   added: (has_bolt ws3)
   goals met: 4 of 4
